{"tuto":
	[ 
		{
			"name":"Lancer",
			"type":"BasicLancer",
			"title":"Lancers",
			"desc":"Lancers are enemies who charge you on sight, spear ahead in order to pierce you before disappearing.",
			"attack":"Melee attack"
		},{
			"name":"Dragonet",
			"type":"BasicDragonet",
			"title":"Dragonnets",
			"desc":"Dragonets inflict damages on you with their fire-breath until you kill them. Moreover, they will regularly switch to another position, trying to get around your defense.",
			"attack":"Range attack"
		},{
			"name":"Cannon",
			"type":"Cannon",
			"title":"Cannons",
			"desc":"They are non moving enemies firing cannonball towards you. These projectiles have a parabolic trajectory, hitting you at different places of your body.",
			"attack":"Range attack"
		},{
			"name":"Assassin",
			"type":"Assassin",
			"title":"Assassins",
			"desc":"They peacefully walk around till they are away from your field of view. Then, if you do not have killed them, they will stab you which inflicts a huge amount of damages on you.",
			"attack":"Melee attack"
		},{
			"name":"Wall",
			"type":"Wall",
			"title":"Walls",
			"desc":"They do not attack you and can not move. However, they protect a canon. You have to destroy the wall in order to fight back the canon.",
			"attack":"-"
		},{
			"name":"Fire",
			"type":"fire",
			"title":"Fire ennemies",
			"desc":"These enemies are stronger than their basic version. They inflict more damages on you so be careful when you fight them.",
			"attack":"-"
		},{
			"name":"Ice",
			"type":"ice",
			"title":"Ice ennemies",
			"desc":"They are the stronger of your enemies. Their attacks are both faster and more powerful than their fire version.",
			"attack":""
		},{
			"name":"LifePotion",
			"type":"lifePotion",
			"title":"Life's potion",
			"desc":"Potions are here to help you in your quest. Life potions restore a portion of your health.",
			"attack":"-"
		},{
			"name":"PowerPotion",
			"type":"powerPotion",
			"title":"Power's potion",
			"desc":"Potions are here to help you in your quest. Power potions restore a part of your power gauge.",
			"attack":"-"
		},{
			"name":"InvincibilityPotion",
			"type":"invincibilityPotion",
			"title":"Invincibility's potion",
			"desc":"Potions are here to help you in your quest. Invincibility potions make you unattainable, god like, for a short period of time.",
			"attack":"-"
		},{
			"name":"warriorAttackLeap",
			"type":"weaponWarrior",
			"title":"Warrior's attack",
			"desc":"The warrior has a sword. Move your right hand as you were wielding a sword, trying to cut your enemies. Do not try to do a thrusting attack as your hands may not be detected anymore by the Leap Motion.",
			"attack":"-"
		},{
			"name":"warriorDefenceLeap",
			"type":"shieldWarrior",
			"title":"Warrior's defence",
			"desc":"The warrior has a shield. It follows your left hand movements, so you just need to move it on the point of impact of your enemies’ attacks to be protected.",
			"attack":"-"
		},{
			"name":"wizardAttackLeap",
			"type":"weaponWizard",
			"title":"Wizard's attack",
			"desc":"The wizard can cast fire balls. To do so, you have to proceed in two steps. Start by closing your right fist, palm down. Then open it to free the fireball.",
			"attack":"-"
		},{
			"name":"wizardDefenceLeap",
			"type":"shieldWizard",
			"title":"Wizard's defence",
			"desc":"The wizard has a mana shield which can be placed wherever he wants. This spell has a 3 seconds cooldown. To do so, start by closing your left hand to load the shield and finally re-open your hand to place the shield where you need it.",
			"attack":"-"
		},{
			"name":"monkAttackLeap",
			"type":"weaponMonk",
			"title":"Monk's attack",
			"desc":"With your staff you can hit multiple enemies with only one attack. Move your right hand as you were holding a staff trying to sweep your enemies off.",
			"attack":"-"
		},{
			"name":"monkDefenceLeap",
			"type":"shieldMonk",
			"title":"Monk's defence",
			"desc":"The monk can’t protect himself but is able to heal himself, using his concentration. This is done by bringing your hands side by side.",
			"attack":"-"
		},{
			"name":"warriorAttackKeyboard",
			"type":"weaponWarrior",
			"title":"Warrior's attack",
			"desc":"Use the mouse to bring your sword next to the enemy. Then left click will let you swing your sword so you can kill it.",
			"attack":"-"
		},{
			"name":"warriorDefenceKeyboard",
			"type":"shieldWarrior",
			"title":"Warrior's defence",
			"desc":"Use the mouse to move your sword next to the enemy. Left click will let you swing your sword so you can kill it.",
			"attack":"-"
		},{
			"name":"wizardAttackKeyboard",
			"type":"weaponWizard",
			"title":"Wizard's attack",
			"desc":"Move the mouse to place it where you need to cast a fireball. Pushing the left click will load the spell. When releasing the button, the fireball will be cast straight forward.",
			"attack":"-"
		},{
			"name":"wizardDefenceKeyboard",
			"type":"shieldWizard",
			"title":"Wizard's defence",
			"desc":"The Z, Q, S, D keys are used to move the left hand which will cast the 3 seconds cooldown shield. To do so, push the ‘space’ key to start to load the spell. Once released a shield of mana is placed at the hand’s current location.",
			"attack":"-"
		},{
			"name":"monkAttackKeyboard",
			"type":"weaponMonk",
			"title":"Monk's attack",
			"desc":"Use your mouse to move your staff. When near one or more enemies press left click to hit them all with your staff.",
			"attack":"-"
		},{
			"name":"monkDefenceKeyboard",
			"type":"shieldMonk",
			"title":"Monk's defence",
			"desc":"As a monk you can’t defend yourself but you can medidate to heal yourself. To do so, use your mouse and the Z, Q, S, D to bring both hands side by side.",
			"attack":"-"
		},{
			"name":"onPop",
			"type":"princesse",
			"title":"First time playing the game",
			"desc":"In Rush The Music you are a hero trying to reach the castle where the princess Khimaira is imprisoned. However, your path is ambushed by numerous enemies and hazards. Will you manage to survive and reach the tower ?",
			"attack":"-"
		},{
			"name":"Leap",
			"type":"leap",
			"title":"Leap Motion",
			"desc":"The Leap Motion allows you to control the game using your hands. To do so you need to place your hands, palm down, around 15cm above the device. Space your hands about 20 cm to be sure the Leap Motion controller differentiate them. Also avoid going behind the leap, towards your screen.",
			"attack":"-"
		},{
			"name":"Keyboard",
			"type":"keyboard",
			"title":"Keyboard + Mouse",
			"desc":"While in game you can pause the game using the key ‘p’. From this menu you will be able to manage your game or to go back to the main menu.",
			"attack":"-"
		},{
			"name":"experience",
			"type":"experience",
			"title":"Experience",
			"desc":"When killing a ennemy you’ll earn some experience. You can see your progress in the gauge at the bottom of your screen. When you level up, your hero become tougher and gain some health and power.",
			"attack":"-"
		}
	]
}